{
  "main": {
    "name": "Adam Keyser",
    "occupation": "Web Developer",
    "description": "As a web developer, it is my goal to help create websites, applications, and tools that can be used by the masses to help improve their lives.",
    "image": "profilepic.jpg",
    "bio": "I am a recent entry into the IT industry, but I have been interested in technology since I was young. After graduating  with a degree in Elementary Education from Western Kentucky University, I moved to Tennessee and worked as a 4th Grade Reading/Social-Studies teacher for 4 years. It was at this point that I began to take a serious interest in web development, and switched careers to pursue a career as a Web Developer.",
    "contactmessage": "Interested in collaborating with me? Here is how you can reach out to me:.",
    "email": "adam.keyser45@gmail.com",
    "phone": "270-202-8890",
    "address": {
      "street": "4140 Turner's Bend",
      "city": "Goodlettsville",
      "state": "Tennessee",
      "zip": "37072"
    },
    "website": "",
    "resumedownload": "",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/adam.keyser",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/adam-keyser-693741107/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/adamkeyser45",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here are some of the technologies and languages I am competent in",
    "education": [
      {
        "school": "CookSystems FastTrack Program",
        "degree": "",
        "graduated": "August 2021",
        "description": "Java, Spring, React"
      },
      {
        "school": "Vanderbilt University Web Development Bootcamp",
        "degree": "Full-Stack Web Development",
        "graduated": "November 2020",
        "description": "Certification in the MERN stack: Mongo, Express, React, Node"
      },      
      {
        "school": "Western Kentucky University",
        "degree": "Bachelors of Science",
        "graduated": "May 2016",
        "description": "Double Major of Elementary Education and Recreation Administration"
      }
    ],
    "work": [
      {
        "company": "Navient- Xtend Healthcare",
        "title": "Contact Tracer",
        "years": "August 2020 - June 2021",
        "description": "Contacted individuals to complete Contact Tracing interviews on behalf of the Tennessee Department of Health. Gathered critical health information using the REDCap Data Entry System. Instructed coworkers on contact elicitation best practices to insure effective contact tracing efforts."
      },
      {
        "company": "Inglewood Elementary School",
        "title": "4th Grade Reading and Social Studies Teacher",
        "years": "July 2018 - May 2020",
        "description": "Taught 4th Graders in Reading/Language Arts and Social Studies. Learned, modified, and taught new curriculum standards. Designed, developed, and delivered learning materials for 4th grade students. Increased student performance on State Testing from 2018 to 2019. Organized and led Technology meetings to show teachers how to use classroom technology tools."
      },
      {
        "company": "Hazelwood Elementary School",
        "title": "4th Grade Reading and Social Studies Teacher",
        "years": "July 2016 - May 2018",
        "description": "Taught 4th Graders in Reading/Language Arts and Social Studies. Planned Social Studies Curriculum for 4th Grade Team. Conducted structured learning experiences and monitor their quality results. Worked individually with students in focused Reading Small Group instruction."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Illustrator",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "javaDript",
        "category": "A coffee subscription box service for coders and web developers!",
        "image": "javaDript_big.png",
        "url": "https://sleepy-garden-49427.herokuapp.com/#"
      },
      {
        "title": "The Speakeasy",
        "category": "A Full Stack Web Application where people can share, post, comment, and rate bevarage recipes.",
        "image": "speakeasy_big.png",
        "url": "https://fierce-forest-64673.herokuapp.com/"
      },
      {
        "title": "News By The Map",
        "category": "A web application that brings you the latest news based off of a searched location using Google Maps.",
        "image": "news_by_the_map_big.jpg",
        "url": "https://adamkeyser45.github.io/newsbythemap/"
      },
      {
        "title": "Tech Blog",
        "category": "A CMS-style blog site similar to a Wordpress site, where developers can publish their blog posts and comment on other developers’ posts as well.",
        "image": "tech_blog_big.png",
        "url": "https://calm-garden-95272.herokuapp.com/"
      },
      {
        "title": "Budget Tracker",
        "category": "Updating an existing budget tracker application to allow for offline access and functionality.",
        "image": "budget_tracker_big.png",
        "url": "https://nameless-anchorage-01032.herokuapp.com/"
      },
      {
        "title": "NoSQL Social Network API",
        "category": "Video walkthrough of an API for a social network web application where users can share their thoughts, react to friends’ thoughts, and create a friend list.",
        "image": "social_network_api_small.png",
        "url": "https://github.com/adamkeyser45/mod18challenge/blob/main/assets/mod18challenge-walkthrough.mp4"
      },
      {
        "title": "RegEx Tutorial- Matching a URL",
        "category": "A tutorial to teach individuals about Regular Expressions, and how to use one to match for a URL.",
        "image": "regex_big.png",
        "url": "https://gist.github.com/adamkeyser45/07edab6a0a308e48deb96f6136dadd01"
      },
      {
        "title": "Tandem Quiz App",
        "category": "A quiz application for you to practice trivia!",
        "image": "tandem_small.png",
        "url": "https://adamkeyser45.github.io/tandem-quiz/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I was fortunate enough to work with Adam on two group projects during the Vanderbilt Full-Stack Bootcamp. . . Adam's experience as a teacher definitely shined as he helped guide me through difficult portions on our project, allowing me to better understand certain programming concepts. I was grateful to work together again on our final project as he showed the same leadership skills and helped motivate me to work at my best. Adam will be an invaluable asset to any team.",
        "user": "Jon Prine, Music Agent at The Progressive Global Agency"
      },
      {
        "text": "Adam and I worked together on several group projects. He was a fantastic group member, both in his ability & communication, as well as following through with commitments. One of the best attitudes i've ever encountered in a professional environment. Highly, highly recommend.",
        "user": "Jessica Tillson, Student"
      }
    ]
  }
}
